nxp-mcuxpresso/mcux-devices-mcx/MCXN/MCXN527T/iar/startup_MCXN527T_cm33_core0.s
        PUBWEAK Reserved117_IRQHandler
        PUBWEAK Reserved117_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved117_IRQHandler
        LDR     R0, =Reserved117_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved118_IRQHandler
        PUBWEAK Reserved118_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved118_IRQHandler
        LDR     R0, =Reserved118_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved119_IRQHandler
        PUBWEAK Reserved119_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved119_IRQHandler
        LDR     R0, =Reserved119_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved120_IRQHandler
        PUBWEAK Reserved120_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved120_IRQHandler
        LDR     R0, =Reserved120_DriverIRQHandler
        BX      R0

        PUBWEAK FLEXIO_IRQHandler
        PUBWEAK FLEXIO_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
FLEXIO_IRQHandler
        LDR     R0, =FLEXIO_DriverIRQHandler
        BX      R0

        PUBWEAK DAC0_IRQHandler
        PUBWEAK DAC0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DAC0_IRQHandler
        LDR     R0, =DAC0_DriverIRQHandler
        BX      R0

        PUBWEAK DAC1_IRQHandler
        PUBWEAK DAC1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DAC1_IRQHandler
        LDR     R0, =DAC1_DriverIRQHandler
        BX      R0

        PUBWEAK DAC2_IRQHandler
        PUBWEAK DAC2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DAC2_IRQHandler
        LDR     R0, =DAC2_DriverIRQHandler
        BX      R0

        PUBWEAK HSCMP0_IRQHandler
        PUBWEAK HSCMP0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
HSCMP0_IRQHandler
        LDR     R0, =HSCMP0_DriverIRQHandler
        BX      R0

        PUBWEAK HSCMP1_IRQHandler
        PUBWEAK HSCMP1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
HSCMP1_IRQHandler
        LDR     R0, =HSCMP1_DriverIRQHandler
        BX      R0

        PUBWEAK HSCMP2_IRQHandler
        PUBWEAK HSCMP2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
HSCMP2_IRQHandler
        LDR     R0, =HSCMP2_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved128_IRQHandler
        PUBWEAK Reserved128_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved128_IRQHandler
        LDR     R0, =Reserved128_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved129_IRQHandler
        PUBWEAK Reserved129_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved129_IRQHandler
        LDR     R0, =Reserved129_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved130_IRQHandler
        PUBWEAK Reserved130_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved130_IRQHandler
        LDR     R0, =Reserved130_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved131_IRQHandler
        PUBWEAK Reserved131_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved131_IRQHandler
        LDR     R0, =Reserved131_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved132_IRQHandler
        PUBWEAK Reserved132_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved132_IRQHandler
        LDR     R0, =Reserved132_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved133_IRQHandler
        PUBWEAK Reserved133_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved133_IRQHandler
        LDR     R0, =Reserved133_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved134_IRQHandler
        PUBWEAK Reserved134_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved134_IRQHandler
        LDR     R0, =Reserved134_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved135_IRQHandler
        PUBWEAK Reserved135_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved135_IRQHandler
        LDR     R0, =Reserved135_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved136_IRQHandler
        PUBWEAK Reserved136_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved136_IRQHandler
        LDR     R0, =Reserved136_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved137_IRQHandler
        PUBWEAK Reserved137_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved137_IRQHandler
        LDR     R0, =Reserved137_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved138_IRQHandler
        PUBWEAK Reserved138_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved138_IRQHandler
        LDR     R0, =Reserved138_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved139_IRQHandler
        PUBWEAK Reserved139_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved139_IRQHandler
        LDR     R0, =Reserved139_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved140_IRQHandler
        PUBWEAK Reserved140_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved140_IRQHandler
        LDR     R0, =Reserved140_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved141_IRQHandler
        PUBWEAK Reserved141_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved141_IRQHandler
        LDR     R0, =Reserved141_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved142_IRQHandler
        PUBWEAK Reserved142_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved142_IRQHandler
        LDR     R0, =Reserved142_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved143_IRQHandler
        PUBWEAK Reserved143_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved143_IRQHandler
        LDR     R0, =Reserved143_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved144_IRQHandler
        PUBWEAK Reserved144_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved144_IRQHandler
        LDR     R0, =Reserved144_DriverIRQHandler
        BX      R0

